package org.example;

public class Lesson_2 {
    // Змінні
    // Урок:
    public static void main(String[] args) {
        /* int - тип змінної для цілий чисел діапазоном від -2147483648 до 2147483647
           byte - тип змінної для цілий чисел діапазоном від -128 до 127
           short - тип змінної для цілий чисел діапазоном від -32768 до 32767
           long - тип змінної для цілий чисел діапазоном від 9 223 372 036 854 775 808 до 9 223 372
           float - тип змінної для чисел з крапкою
           double - те саме що і float але в 2 рази більших діапазон чисел
           char - тип змінної в якій можна тримати тільки 1 символ в одинарних лапках ''
           String - тип змінної в якій можна тримати якесь слово
           boolean - тип змінної яка тримає значення true / false
        */


        /* int num;
        num = 56;
        System.out.println("Number is " + num);
        num = 121; // тут ми змінили значення змінної
        System.out.println("Number is " + num);

        boolean isHappy = true; */
    }
}
